/*
напишите программу, которая выводит на консоль две строки: "Hello World" и "Hello C"
*/
#include <stdio.h>
  
int main(void)
{
    printf("Hello World\n");
    printf("Hello C\n");
    return 0;

}
