/*Определите и вызове функцию, которую назовите hello_world 
и которая будет выводить на консоль строку "Hello World!".*/
#include <stdio.h>
 
void hello_world()
{
    printf("Hello World!\n");
}
int main(void)
{
    hello_world();
    return 0;
}