/*Напишите программу, в которой определите массив символов и 
выведете его на консоль с помощью спецификатора %s:*/
#include <stdio.h>
 
int main()
{
    char message[] = "Hello METANIT.COM";
    printf("%s\n", message);
    return 0;
}